Управление_пожарной_частью_/src/Documents/СдачаНормативов/СдачаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СдачаНормативов</name>
  <basedOn>Document.ПланСдачиНормативов</basedOn>
  <registerRecords>InformationRegister.РезультатВыполненияНормативов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Караул</name>
    <type>
      <types>CatalogRef.ГруппаСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТренировки</name>
    <type>
      <types>CatalogRef.ТипТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.МестоПроведенияТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Инструктор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Норматив</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/СдачаНормативов/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СдачаНормативов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СдачаНормативов.Дата,
	|	СдачаНормативов.Инструктор,
	|	СдачаНормативов.Караул,
	|	СдачаНормативов.МестоПроведения,
	|	СдачаНормативов.НачальникКараула,
	|	СдачаНормативов.Номер,
	|	СдачаНормативов.Организация,
	|	СдачаНормативов.ТипТренировки,
	|	СдачаНормативов.Нормативы.(
	|		НомерСтроки,
	|		Сотрудник,
	|		Норматив,
	|		Результат,
	|		Оценка
	|	)
	|ИЗ
	|	Документ.СдачаНормативов КАК СдачаНормативов
	|ГДЕ
	|	СдачаНормативов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНормативыШапка = Макет.ПолучитьОбласть("НормативыШапка");
	ОбластьНормативы = Макет.ПолучитьОбласть("Нормативы");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Подпись = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНормативыШапка);
		ВыборкаНормативы = Выборка.Нормативы.Выбрать();
		Пока ВыборкаНормативы.Следующий() Цикл
			ОбластьНормативы.Параметры.Заполнить(ВыборкаНормативы);
			ТабДок.Вывести(ОбластьНормативы, ВыборкаНормативы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Подпись);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
